// 2023. 10. 9 월										(6주 1일)
// 10월 25일(8주 2일) - 중간시험
//---------------------------------------------------------------------------
// [실습] 배열에 있는 많은 데이터를 읽고 쓰기
//---------------------------------------------------------------------------
// [과제] 값을 바꿔가며 반복 연습
//---------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include "save.h"
using namespace std;

// [문제] "소스.cpp" 에 알파벳 소문자의 개수를 세서 다음과 같이 출력하라
// a - 12
// b - 22
// ...
// z - 0

//--------
int main()
//--------
{
	ifstream in{ "소스.cpp" };
	if (!in) {
		cout << "파일을 열 수 없음" << endl;
		return 0;
	}

	int num[26]{};
	char c;
	while (in >> c) {
		if (islower(c)) {
			++num[c - 'a'];
		}
	}

	for (int i = 0; i < 26; ++i) {
		cout << static_cast<char>('a' + i) << " - " << num[i] << endl;
	}
	
	save("소스.cpp");
}