// 2023. 10. 16 월										(7주 1일)
// 10월 25일(8주 2일) - 중간시험
//---------------------------------------------------------------------------
// [실습] 파일에 데이터를 읽고 쓰기
//---------------------------------------------------------------------------
// [과제] 값을 바꿔 가며 반복 연습한다
//---------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include "save.h"
using namespace std;

// [문제] "소스.cpp" 를 읽어 알파벳 소문자를 모두 대문자로 바꿔
// "소스대문자.cpp"에 저장하라

//--------
int main()
//--------
{
	ifstream in{ "소스.cpp" };
	ofstream out{ "소스대문자.cpp" };

	if (!in) {
		cout << "파일을 열 수 없음" << endl;
		return 0;
	}

	char c;
	in >> noskipws;
	while (in >> c) {
		if (islower(c)) {
			c = toupper(c);
		}
		out << c;
	}
	
	save("소스.cpp");
}