// 2023. 10. 9 월										(6주 1일)
// 10월 25일(8주 2일) - 중간시험
//---------------------------------------------------------------------------
// 실행 파일과 메모리(Free Store)
//---------------------------------------------------------------------------
// 과제 - C++ STACK DATA CODE Free Store
//---------------------------------------------------------------------------

#include <iostream>
#include <chrono>
#include "save.h"
using namespace std;

// [관찰] 윈도우의 메모리 관리를 확인해 본다(ctrl + alt + delete)

//--------
int main()
//--------
{
	save("소스.cpp");
	int cnt{};
	while (true) {
		new char[1'000'000'000] {1, 2, 3};
		cout << ++cnt << "기가 요청" << endl;
		this_thread::sleep_for(3s);				// 3초 쉰다
	}
}
