// 2023. 10. 9 월										(6주 1일)
// 10월 25일(8주 2일) - 중간시험
//---------------------------------------------------------------------------
// 실행 파일과 메모리(Free Store)
//---------------------------------------------------------------------------
// 과제 - C++ STACK DATA CODE Free Store
//---------------------------------------------------------------------------

#include <iostream>
#include "save.h"
using namespace std;

//--------
int main()
//--------
{
	save("소스.cpp");
	int cnt{};
	while (true) {
		// 메모리 1GB 동적할당
		try	{
			new char[1'000'000'000];			// 할당해줄 메모리가 없으면 시스템은 예외를 던진다
		}
		catch (exception& e) {
			cout << e.what() << endl;
			return 333;
		}
		cout << ++cnt << "기가 바이트 요청" << endl;
	}
}
