// 2023. 10. 16 월										(7주 1일)
// 10월 25일(8주 2일) - 중간시험
//---------------------------------------------------------------------------
// [실습] 파일에 데이터를 읽고 쓰기
//---------------------------------------------------------------------------
// [과제] 값을 바꿔
//---------------------------------------------------------------------------

#INCLUDE <IOSTREAM>
#INCLUDE <FSTREAM>
#INCLUDE "SAVE.H"
USING NAMESPACE STD;

// [문제] "소스.CPP" 를 읽어 알파벳 소문자를 모두 대문자로 바꿔
// "소스대문자.CPP"에 저장하라

//--------
INT MAIN()
//--------
{
	IFSTREAM IN{ "소스.CPP" };
	OFSTREAM OUT{ "소스대문자.CPP" };

	IF (!IN) {
		COUT << "파일을 열 수 없음" << ENDL;
		RETURN 0;
	}

	CHAR C;
	IN >> NOSKIPWS;
	WHILE (IN >> C) {
		IF (ISLOWER(C)) {
			C = TOUPPER(C);
		}
		OUT << C;
	}
	
	SAVE("소스.CPP");
}