// 2023. 10. 9 월										(6주 1일)
// 10월 25일(8주 2일) - 중간시험
//---------------------------------------------------------------------------
// [실습] 배열에 있는 많은 데이터를 읽고 쓰기
//---------------------------------------------------------------------------
// [과제] 값을 바꿔가며 반복 연습
//---------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include <random>
#include "save.h"
using namespace std;

// [문제] "int만개.txt"에는 int 값을 10000개가 있다
// 가장 작은 값을찾아 화면에 출력하라 

//--------
int main()
//--------
{
	ifstream in{ "int만개.txt" };
	if (!in) {
		cout << "해당 파일을 열 수 없음" << endl;
		return 0;
	}

	int min{ numeric_limits<int>::max() };
	int n;
	while (in >> n) {
		if (min > n) {
			min = n;
		}
	}

	cout << "최소값 : " << min << endl;
	save("소스.cpp");
}