// 2023. 9. 27 월										(4주 2일)
// 10월 2일 (5주 1일) - 동영상 강의
// 10월 25일(6주 2일) - 중간시험
//---------------------------------------------------------------------------
// change 함수
//---------------------------------------------------------------------------
// 정렬
//---------------------------------------------------------------------------

#include <iostream>
#include "save.h"
using namespace std;

void change(int&, int&);			// call-by reference

//--------
int main()
//--------
{
	int a{ 1 }, b{ 2 };

	change(a, b);

	cout << a << ", " << b << endl;
	save("소스.cpp");
}

void change(int& p, int& q) {
	int temp{ p };
	p = q;
	q = temp;
}