// 2023. 9. 11 월										(2주 1일)
//---------------------------------------------------------------------------
// C++ 입출력 - C++20기준
//---------------------------------------------------------------------------
// 과제 C++ I/O 관련 내용 읽어보기
//---------------------------------------------------------------------------

#include <iostream>
#include "save.h"
using namespace std;

//--------
int main()				// cin, cout, cerr, clog
//--------
{
	// [문제] int 값 2를 입력받아 합계를 출력하라
	int a, b;

	cout << "두 수의 합 구하기" << endl;
	cout << "a를 입력하세요" << endl;
	cin >> a;
	cout << "b를 입력하세요" << endl;
	cin >> b;

	int result = a + b;
	cout << "합계: " << result << endl;

	save("소스.cpp");
}
